In [ ]:
# Importacion de librerias necesarias para el analisis exploratorio (EDA)
# -------------------------------------------------------------------------------
# Tratamiento de datos
import pandas as pd

#Gestion de archivos y rutas
import os
import sys

# Visualizacion de datos
import matplotlib.pyplot as plt
import seaborn as sns

# Configuracion de Pandas y eliminacion de warnings
pd.set_option('display.max_columns', None)  # Mostrar todas las columnas en los DataFrames
import warnings
warnings.filterwarnings("ignore")  # Ocultar warnings innecesarios

# Funciones de extraccion y exploracion de datos
# Obtener la ruta del directorio raiz del proyecto
ruta_proyecto = os.path.abspath(os.path.join(os.getcwd(), ".."))
# Agregar src/ al path si no esta ya incluido
if ruta_proyecto not in sys.path:
    sys.path.append(ruta_proyecto)
    
# Importar modulos de src   
from src import eda
from src import variables as va

## TEST FUNCIONES âœ¨

In [2]:
# cargar datos
df = eda.extraer_datos_csv("../datos/bruto/Bank_Customer_Churn_Prediction.csv")

âœ… Datos extraidos correctamente. Filas: 10000, Columnas: 12

,customer_id,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
0,15634602,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [3]:
# Revisar estructura del dataset
eda.revisar_estructura(df)

ðŸ“Œ Dimensiones del dataset:
  - Filas: 10000
  - Columnas: 12

ðŸ“Œ Nombres de las columnas:
['customer_id', 'credit_score', 'country', 'gender', 'age', 'tenure', 'balance', 'products_number', 'credit_card', 'active_member', 'estimated_salary', 'churn']

ðŸ“Œ Tipos de datos:
customer_id           int64
credit_score          int64
country              object
gender               object
age                   int64
tenure                int64
balance             float64
products_number       int64
credit_card           int64
active_member         int64
estimated_salary    float64
churn                 int64
dtype: object

ðŸ“Œ Datos duplicados: 0 (0.0%)

In [4]:
# Identificar filas duplicadas
eda.get_duplicate_rows(df)

âœ… No hay filas duplicadas en el dataset.

Empty DataFrame
Columns: [customer_id, credit_score, country, gender, age, tenure, balance, products_number, credit_card, active_member, estimated_salary, churn]
Index: []

In [5]:
# Revisar valores nulos y duplicados
df_nulos = eda.revisar_valores_nulos(df)

ðŸ“Œ Columnas con valores nulos: 0
ðŸ“Œ Columnas sin valores nulos: 12

Empty DataFrame
Columns: [Valores nulos, % Nulos, % No Nulos, Valores Unicos, Tipo de Dato]
Index: []

In [6]:
# Obtener estadisticas descriptivas
eda.obtener_estadisticas(df)

ðŸ“Œ Estadisticas descriptivas de variables numericas:

,count,mean,std,min,25%,50%,75%,max
customer_id,10000.0,1.569094e+07,71936.186123,15565701.00,15628528.25,1.569074e+07,1.575323e+07,15815690.00
credit_score,10000.0,6.505288e+02,96.653299,350.00,584.00,6.520000e+02,7.180000e+02,850.00
age,10000.0,3.892180e+01,10.487806,18.00,32.00,3.700000e+01,4.400000e+01,92.00
tenure,10000.0,5.012800e+00,2.892174,0.00,3.00,5.000000e+00,7.000000e+00,10.00
balance,10000.0,7.648589e+04,62397.405202,0.00,0.00,9.719854e+04,1.276442e+05,250898.09
products_number,10000.0,1.530200e+00,0.581654,1.00,1.00,1.000000e+00,2.000000e+00,4.00
credit_card,10000.0,7.055000e-01,0.455840,0.00,0.00,1.000000e+00,1.000000e+00,1.00
active_member,10000.0,5.151000e-01,0.499797,0.00,0.00,1.000000e+00,1.000000e+00,1.00
estimated_salary,10000.0,1.000902e+05,57510.492818,11.58,51002.11,1.001939e+05,1.493882e+05,199992.48
churn,10000.0,2.037000e-01,0.402769,0.00,0.00,0.000000e+00,0.000000e+00,1.00

ðŸ“Œ Estadisticas descriptivas de variables categoricas:

         count unique     top  freq
country  10000      3  France  5014
gender   10000      2    Male  5457

In [7]:
# Revisar valores unicos en variables categoricas
eda.revisar_valores_unicos(df)

ðŸ“Œ Analisis de valores unicos en variables categoricas:


----------- ANALIZANDO: 'COUNTRY' -----------

Valores unicos: ['France' 'Spain' 'Germany']

Frecuencia de valores:
country
France     5014
Germany    2509
Spain      2477
Name: count, dtype: int64


----------- ANALIZANDO: 'GENDER' -----------

Valores unicos: ['Female' 'Male']

Frecuencia de valores:
gender
Male      5457
Female    4543
Name: count, dtype: int64

In [8]:
# Renombrar columnas 
df.rename(columns=va.columnas_renombradas, inplace=True)
display(df.head())

,id_cliente,puntacion_credito,pais,genero,edad,antiguedad,saldo,num_productos,tarjeta_credito,miembro_activo,salario_estimado,abandono
0,15634602,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [9]:
df = eda.transformar_binarios(df, va.columnas_binarias)
display(df[va.columnas_binarias].head())

  tarjeta_credito miembro_activo abandono
0              Si             Si       Si
1              No             Si       No
2              Si             No       Si
3              No             No       No
4              Si             Si       No

In [10]:
eda.obtener_estadisticas(df)

ðŸ“Œ Estadisticas descriptivas de variables numericas:

,count,mean,std,min,25%,50%,75%,max
id_cliente,10000.0,1.569094e+07,71936.186123,15565701.00,15628528.25,1.569074e+07,1.575323e+07,15815690.00
puntacion_credito,10000.0,6.505288e+02,96.653299,350.00,584.00,6.520000e+02,7.180000e+02,850.00
edad,10000.0,3.892180e+01,10.487806,18.00,32.00,3.700000e+01,4.400000e+01,92.00
antiguedad,10000.0,5.012800e+00,2.892174,0.00,3.00,5.000000e+00,7.000000e+00,10.00
saldo,10000.0,7.648589e+04,62397.405202,0.00,0.00,9.719854e+04,1.276442e+05,250898.09
num_productos,10000.0,1.530200e+00,0.581654,1.00,1.00,1.000000e+00,2.000000e+00,4.00
salario_estimado,10000.0,1.000902e+05,57510.492818,11.58,51002.11,1.001939e+05,1.493882e+05,199992.48

ðŸ“Œ Estadisticas descriptivas de variables categoricas:

                 count unique     top  freq
pais             10000      3  France  5014
genero           10000      2    Male  5457
tarjeta_credito  10000      2      Si  7055
miembro_activo   10000      2      Si  5151
abandono         10000      2      No  7963